<!-- terraform-plan-comment -->
# Terraform Plan Results

**4 change(s):** 3 to create, 1 to update, 0 to replace, 0 to destroy

**⚠️ Resources will be modified**

## Resources to create:
- `databricks_group.genie_civics`
- `databricks_group_member.genie_civics_beta_in_mart_civics_readers`
- `databricks_mws_permission_assignment.genie_civics`

## Resources to update:
- `astro_deployment.environments["dev"]`

<details>
<summary>Show diff</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # astro_deployment.environments["dev"] will be updated in-place
  ~ resource "astro_deployment" "environments" {
      ~ airflow_version                = "3.1.7" -> (known after apply)
      ~ astro_runtime_version          = "3.1-13" -> (known after apply)
      + cluster_id                     = (known after apply)
      ~ dag_tarball_version            = "2026-03-05T19:04:40.3838741Z" -> (known after apply)
      ~ desired_dag_tarball_version    = "2026-03-05T19:04:40.3838741Z" -> (known after apply)
        id                             = "cml8n1tav1nxs01nd7ptp4tpm"
      ~ image_repository               = "cllv8mn4p004k01mvj569us1h.registry.astronomer.run/cmgicqn2w002701mqfw3367w2/cml8n1tav1nxs01nd7ptp4tpm" -> (known after apply)
      ~ image_tag                      = "deploy-2026-03-05T16-22-54" -> (known after apply)
      ~ image_version                  = "deploy-2026-03-05T16-22-54" -> (known after apply)
        name                           = "astro-dev"
      ~ scaling_spec                   = {
          ~ hibernation_spec = {
              - override  = {
                  - is_active      = true -> null
                  - is_hibernating = false -> null
                } -> null
                # (1 unchanged attribute hidden)
            }
        }
      ~ scaling_status                 = {
          ~ hibernation_status = {
              ~ is_hibernating  = false -> (known after apply)
              ~ next_event_at   = "2026-03-06T01:00:00Z" -> (known after apply)
              ~ next_event_type = "HIBERNATE" -> (known after apply)
              ~ reason          = "Manual override to wake until further notice" -> (known after apply)
            } -> (known after apply)
        } -> (known after apply)
      ~ scheduler_cpu                  = "1" -> (known after apply)
      ~ scheduler_memory               = "2Gi" -> (known after apply)
      ~ scheduler_replicas             = 1 -> (known after apply)
      ~ status                         = "HEALTHY" -> (known after apply)
      + status_reason                  = (known after apply)
      ~ updated_at                     = "2026-03-05 19:04:40.572 +0000 UTC" -> (known after apply)
      ~ updated_by                     = {
          ~ api_token_name = "git-deploy-46fd7986-7d66-4d63-a6c9-11b40cf2d749" -> (known after apply)
          + avatar_url     = (known after apply)
          + full_name      = (known after apply)
          ~ id             = "cmmdu4i832gh801nxbyatpgdw" -> (known after apply)
          ~ subject_type   = "SERVICEKEY" -> (known after apply)
          + username       = (known after apply)
        } -> (known after apply)
      ~ webserver_airflow_api_url      = "cml8n1tav1nxs01nd7ptp4tpm.pm.astronomer.run/dptp4tpm/api/v2" -> (known after apply)
      ~ webserver_ingress_hostname     = "cml8n1tav1nxs01nd7ptp4tpm.pm.astronomer.run/dptp4tpm" -> (known after apply)
      ~ webserver_url                  = "cml8n1tav1nxs01nd7ptp4tpm.pm.astronomer.run/dptp4tpm" -> (known after apply)
      ~ workload_identity              = "arn:aws:iam::111928029897:role/astro-galactian-element-5125" -> (known after apply)
        # (23 unchanged attributes hidden)
    }

  # databricks_group.genie_civics will be created
  + resource "databricks_group" "genie_civics" {
      + acl_principal_id           = (known after apply)
      + allow_cluster_create       = false
      + allow_instance_pool_create = false
      + databricks_sql_access      = false
      + display_name               = "genie_civics"
      + id                         = (known after apply)
      + url                        = (known after apply)
      + workspace_access           = false
      + workspace_consume          = false
    }

  # databricks_group_member.genie_civics_beta_in_mart_civics_readers will be created
  + resource "databricks_group_member" "genie_civics_beta_in_mart_civics_readers" {
      + group_id  = "80838868848859"
      + id        = (known after apply)
      + member_id = (known after apply)
    }

  # databricks_mws_permission_assignment.genie_civics will be created
  + resource "databricks_mws_permission_assignment" "genie_civics" {
      + id           = (known after apply)
      + permissions  = [
          + "USER",
        ]
      + principal_id = (known after apply)
      + workspace_id = 3578414625112071
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ astro_deployments    = {
      ~ dev  = {
            id            = "cml8n1tav1nxs01nd7ptp4tpm"
            name          = "astro-dev"
          ~ webserver_url = "cml8n1tav1nxs01nd7ptp4tpm.pm.astronomer.run/dptp4tpm" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged attribute hidden)
    }
```

</details>

---

<details>
<summary>What do these mean?</summary>

- **Create**: New resources will be added
- **Update**: Existing resources will be modified in-place
- **Replace**: Resources will be destroyed and recreated (data loss possible)
- **Destroy**: Resources will be permanently deleted

</details>

---

**To apply these changes:**

1. **Merge** this PR to `main`
2. **Review** the plan in the workflow run triggered by the merge
3. **Deploy** via Actions → Deploy → Run workflow → uncheck "Dry run"

Or via CLI after merge: `gh workflow run deploy.yaml -f dry_run=false`
